# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [18]:
#Your code here
c.execute("""SELECT firstName, lastName, city, state FROM employees JOIN offices USING (officecode) ORDER BY firstname asc""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

23

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [17]:
c.execute("""SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
            FROM customers
            JOIN orders
            USING (customerNumber)""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

326

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [21]:
c.execute("""SELECT contactfirstName, contactlastName, checkNumber, amount, paymentDate FROM customers JOIN payments USING (customernumber);""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

    contactFirstName contactLastName checkNumber     amount paymentDate
0            Carine          Schmitt    HQ336336    6066.78  2004-10-19
1            Carine          Schmitt    JM555205   14571.44  2003-06-05
2            Carine          Schmitt    OM314933    1676.14  2004-12-18
3               Jean            King    BO864823   14191.12  2004-12-17
4               Jean            King     HQ55022   32641.98  2003-06-06
5               Jean            King    ND748579   33347.88  2004-08-20
6              Peter        Ferguson     GG31455   45864.03  2003-05-20
7              Peter        Ferguson    MA765515   82261.22  2004-12-15
8              Peter        Ferguson    NP603840    7565.08  2003-05-31
9              Peter        Ferguson     NR27552   44894.74  2004-03-10
10           Janine          Labrune    DB933704   19501.82  2004-11-14
11           Janine          Labrune    LN373447   47924.19  2004-08-08
12           Janine          Labrune     NG94694   49523.67  2005-02-22
13            Jonas       Bergulfsen    DB889831   50218.95  2003-02-16
14            Jonas       Bergulfsen    FD317790    1491.38  2003-10-28
15            Jonas       Bergulfsen    KI831359   17876.32  2004-11-04
16            Jonas       Bergulfsen    MA302151   34638.14  2004-11-28
17             Susan          Nelson    AE215433  101244.59  2005-03-05
18             Susan          Nelson    BG255406   85410.87  2004-08-28
19             Susan          Nelson    CQ287967   11044.30  2003-04-11
20             Susan          Nelson     ET64396   83598.04  2005-04-16
21             Susan          Nelson    HI366474   47142.70  2004-12-27
22             Susan          Nelson     HR86578   55639.66  2004-11-02
23             Susan          Nelson    KI131716  111654.40  2003-08-15
24             Susan          Nelson    LF217299   43369.30  2004-03-26
25             Susan          Nelson    NT141748   45084.38  2003-11-25
26            Roland          Keitel    DI925118   10549.01  2003-01-28
27            Roland          Keitel    FA465482   24101.81  2003-10-18
28            Roland          Keitel    FH668230   33820.62  2004-03-24
29            Roland          Keitel    IP383901    7466.32  2004-11-18
..               ...             ...         ...        ...         ...
243           Leslie          Murphy    HA777606   38139.18  2003-12-05
244           Leslie          Murphy    IR662429   32239.47  2004-05-12
245               Yu            Choi    GJ715659   27550.51  2004-11-13
246               Yu            Choi    MO743231    1679.92  2004-04-30
247          Martín           Sommer    DD995006   33145.56  2004-11-15
248          Martín           Sommer    NA377824   22162.61  2004-02-06
249          Martín           Sommer    OO606861   57131.92  2003-06-13
250          Violeta         Benitez    ED203908   30293.77  2005-04-15
251          Violeta         Benitez     GC60330    9977.85  2003-11-08
252          Violeta         Benitez    PE176846   48355.87  2004-11-27
253             Sean        Clenahan    AB661578    9415.13  2004-07-28
254             Sean        Clenahan    CO645196   35505.63  2003-12-10
255           Franco         Ricotti    LL427009    7612.06  2004-02-17
256           Franco         Ricotti    PC688499   17746.26  2003-10-27
257            Steve        Thompson    JP113227    7678.25  2003-12-09
258            Steve        Thompson    PB951268   36070.47  2004-02-13
259      José Pedro             Roel    GK294076    3474.66  2004-10-26
260      José Pedro             Roel    JH546765   47513.19  2003-11-29
261             Rosa         Salazar     BL66528    5899.38  2004-04-14
262             Rosa         Salazar     HS86661   45994.07  2004-11-23
263             Rosa         Salazar    JB117768   25833.14  2003-03-20
264              Sue          Taylor    AH612904   29997.09  2003-09-28
265              Sue          Taylor    PT550181   12573.28  2004-02-29
266          Thomas            Smith    OC773849   22275.73  2003-12-04
267          Thomas            Smith    PO860906    7310.42  2004-01-31
268          Valarie          Franco    BH167026   59265.14  2003-12-26
269          Valarie          Franco    FN155234    6276.60  2004-05-14
270             Tony         Snowden    EU531600   30253.75  2005-05-25
271             Tony         Snowden    MB342426   32077.44  2003-07-16
272             Tony         Snowden     MN89921   52166.00  2004-12-31

[273 rows x 5 columns]

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [4]:
# Your code here

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!